content/posts/shabani2021.md
+++
title = "shabani2021 | A branch-and-prune method to solve closure equations in dual quaternions"
author = ["João Gutemberg Farias"]
draft = false
+++

tags
: [Dual Quaternions Applications]({{< relref "dual_quaternions_applications" >}})

The authors uses dual quaternions to formulate [closure loop equations]({{< relref "closure_loop_equations" >}}) as a system of [multiaffine equations]({{< relref "multiaffine_equations" >}}), they then introduce a new [branch-and-prune method]({{< relref "branch_and_prune_method" >}}) tailored to this type of equations to solve the system which can reduce computing time up to 2 orders of magnitude compared to traditional approaches.


## Info {#info}


## Notes {#notes}


### Resumo {#resumo}

O autor resolve equações de fechamento de loops cinemáticos de uma forma mais eficiente usando quatérnios duais. Ele escreve as equações como um sistema de equações _multiaffine_ e usa um método _branch-and-prune_ para resolver o sistema de equações. Consegue obter resoluções duas ordens de magnitude mais rápido do que as tradicionais, para problemas específicos.
